In [ ]:
"""
Problem Statement No. 07 <br>
Perform the following operations using Python on any open source dataset.<br> 
1. Import all the required Python Libraries
2. Load the Dataset into pandas data frame
4. Data Preprocessing: check for missing values in the data to get some initial statistics. Provide variable descriptio<br>ns. 
Types of variables etc. Check the dimensions of the data frame.  
5. Data Formatting and Data Normalization: Summarize the types of variables by checking the data types (i.e., 
character, numeric, integer, factor, and logical) of the variables in the data set. If variables are not in the correct data 
type, apply proper type conversions. 
6. Turn categorical variables into quantitative variables in Python. In addition to the codes and outputs, expla<br>in every 
operation that you do in the above steps and explain everything that you do to import/read/scrape the set.      
"""

In [44]:
import pandas as pd
import numpy as np

In [45]:
df = pd.read_excel('nba.xlsx')

In [46]:
df.sample(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
5,Amir Johnson,Boston Celtics,90,PF,29,2024-06-09 00:00:00,240,NaN,12000000.0
422,Cameron Payne,Oklahoma City Thunder,22,PG,21,2024-06-03 00:00:00,185,Murray State,2021520.0
253,K.J. McDaniels,Houston Rockets,32,SG,23,2024-06-06 00:00:00,205,Clemson,3189794.0
269,Ray McCallum,Memphis Grizzlies,5,PG,24,2024-06-03 00:00:00,190,Detroit,NaN
278,Luke Babbitt,New Orleans Pelicans,8,SF,26,2024-06-09 00:00:00,225,Nevada,1100602.0

In [47]:
df.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College     84
Salary      11
dtype: int64

In [48]:
df.shape

(457, 9)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    int64
 3   Position  457 non-null    object
 4   Age       457 non-null    int64
 5   Height    457 non-null    object
 6   Weight    457 non-null    int64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(1), int64(3), object(5)
memory usage: 32.3+ KB

In [50]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [51]:
mode = df['College'].mode()

In [52]:
mode

0    Kentucky
Name: College, dtype: object

In [53]:
df['College'].fillna('Kentucky' , inplace=True)

C:\Users\palas\AppData\Local\Temp\ipykernel_16224\3769564356.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['College'].fillna('Kentucky' , inplace=True)

In [54]:
df.isnull().sum()

Name         0
Team         0
Number       0
Position     0
Age          0
Height       0
Weight       0
College      0
Salary      11
dtype: int64

In [55]:
df.dropna(inplace= True)

In [56]:
df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      446 non-null    object
 1   Team      446 non-null    object
 2   Number    446 non-null    int64
 3   Position  446 non-null    object
 4   Age       446 non-null    int64
 5   Height    446 non-null    object
 6   Weight    446 non-null    int64
 7   College   446 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(1), int64(3), object(5)
memory usage: 34.8+ KB

In [58]:
df = pd.get_dummies(df,columns=['Team','Position','College'] , drop_first=True )

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 446 entries, 0 to 456
Columns: 153 entries, Name to College_Xavier
dtypes: bool(147), float64(1), int64(3), object(2)
memory usage: 88.4+ KB